Show / Hide Table of Contents
Enum CalculationType
Calculation type
Namespace: IdeaRS.OpenModel.Concrete.CheckResult
Assembly: IdeaRS.OpenModel.dll
Syntax
public enum CalculationType
Fields
 Name |  Description
 Baumann
calculation internal forces for slabs/shells/walls
 BrittleFailure
brittle failure check
 Capacity
calculation of capacity by the interaction diagram
 CapacityMesh
interaction diagram on mesh
 ColumnForces
Recalculation of internal forces on compression members (effect of geometric imperfections and second order effect).
 ConcreteCover
calculation of creep and shrinkage
 CrackingCalculation
calculation if cross section is cracked
 CrackingCalculationLong
calculation if cross section is cracked
 CrackingCalculationShort
calculation if cross section is cracked
 CrackWidthLong
crack width check - long
 CrackWidthShort
crack width check - short
 CrackWidthStage
crack width check - stage
 CreepAndShrinkageCoefficient
calculation of creep and shrinkage
 CrossSectionCharacteristicsLong
calculation cross-section characteristics - long
 CrossSectionCharacteristicsShort
calculation cross-section characteristics - short
 CrossSectionCharacteristicsStage
calculation cross-section characteristics - stage
 Deflection
deflection check
 DesignReinforcement
desing of reinforcement
 Detailing
detailing check
 Fatigue
calculation - response for fatigue
 InitilaStateofCrossSection
initial state of cross-section
 Interaction
interaction shear+torsion
 LinearStressLong
Linear stress check - long
 LinearStressShort
Linear stress check - short
 LinearStressStage
Linear stress check - stage
 LongTermLosses
calculation long term losses calculation
 LongTermLossesCoefficient
calculation long-term losses coefficient
 MNKappaDiagramSLSLong
calculation M-N-Kappa diagram SLS-long
 MNKappaDiagramSLSShort
calculation M-N-Kappa diagram SLS-short
 MNKappaDiagramULS
calculation M-N-Kappa diagram ULS
 NotDefined
not defined check
 OverallColumnRecalculation
all internal forces are recalculated because of slenderness/imperfections etc...
 PrestressEffects
calculation prestress effects
 Primaryforces
calculation primary forces
 Redistribution
calculation of redistribution
 Response
calculation plane of deformation
 Shear
shear check
 StiffnessLong
stiffness calculation - long
 StiffnessShort
stiffness calculation - short
 StiffnessStage
stiffness calculation - stage
 StiffnessStageLong
calculation siffness with effective modulus of elasticity
 StressLimitationLong
stress limitation check - long
 StressLimitationShort
stress limitation check - short
 StressLimitationStage
stress limitation check - stage
 StrutAngle
angle of concrete strut
 Torsion
torsion check
 Improve this Doc
 View Source